cf_billing/Documents/энргПоступлениеОплатыЧерезКонтроллера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргПоступлениеОплатыЧерезКонтроллера</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.энргОбъемСубсидий</xr:Item>
				<xr:Item>AccumulationRegister.энргВзаиморасчетыПоПени</xr:Item>
				<xr:Item>AccumulationRegister.энргОбъемНачислений</xr:Item>
				<xr:Item>InformationRegister.энргПоказанияПриборовУчета</xr:Item>
				<xr:Item>AccumulationRegister.энргОплатаУслуг</xr:Item>
				<xr:Item>InformationRegister.энргИсторияОплаты</xr:Item>
				<xr:Item>AccumulationRegister.энргВзаиморасчеты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контроллер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСменыККМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЧекаККМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщаяСуммаОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЧековККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Абонент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЗадолженности</Name>
							<Type>
								<v8:Type>cfg:EnumRef.энргВидыЗадолженности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>18</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МКД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодОплаты</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Район</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПоказанияПриборовУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПоследнихПоказаний</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеТарифа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентПУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальноВозможныеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальноВозможныйОбъемПотребления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Переворот</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПереворотИзмененПользователем</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредыдущиеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разница</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеПоказаний</Name>
							<Type>
								<v8:Type>cfg:EnumRef.энргСостояниеПоказаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СреднийОбъемПотребления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусИзмененПользователем</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифнаяЗона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущиеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьАбонент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьЛицевойСчет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>18</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьПриборУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьТочкаУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьУслуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаОтклонения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.энргПричиныОтклоненияПоказаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТочкиУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТочкаУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриборУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьВидДифференцированности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыДифференцированности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Абонент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьАдресАбонента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючПомещения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ШкалыПриборовУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтрокиТочкиУчета</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДифференцированности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыДифференцированности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Шкала</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/Enums/СтатусыЧековККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЧековККМ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Пробит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отложен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/Enums/ФормыОплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ФормыОплаты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежнаяКарта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кредит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сертификат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/Documents/энргПоступлениеОплатыЧерезКонтроллера/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);
		КонецЕсли;
	КонецЕсли;

	БанковскиеРеквизиты 							= энргОбщегоНазначения.БанковскиеРеквизитыОрганизации();
	
	ИспользоватьПодключаемоеОборудование 			= истина;
	
	УстройствоПечати 								= ПодключаемоеОборудованиеВызовСервера.ВернутьИдентификаторУстройстваДляПечатиДокументов();

	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
		
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	энргРаботаСприборамиУчетаСервер.ЗаполнитьСвойствоРегистрируетОбъемПриЧтении(Объект.ТочкиУчета,ТекущийОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовШапки

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда 		
		Объект.ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация); 		
	КонецЕсли; 
КонецПроцедуры

#КонецОбласти

#Область СобытияТабличнойЧасти_Оплата

&НаКлиенте
Процедура ОплатаАбонентПриИзменении(Элемент)
	УдалитьСтрокиПоказаний(ТекАбонентОплаты);
	ТекСтрока  = Элементы.Оплата.ТекущиеДанные;
	// заполняем данные абонента
	энргПользовательскийВводКлиент.ПриИзмененииАбонента(ТекСтрока);

	// заполняем приборы учета
	ДанныеСтроки  = Новый Структура("МКД,Абонент,ЛицевойСчет,Район",ТекСтрока.МКД,ТекСтрока.Абонент,ТекСтрока.ЛицевойСчет,ТекСтрока.Район);
	ЗаполнитьДанныеПриборовУчетаСервер(ДанныеСтроки);  
	
КонецПроцедуры


&НаКлиенте
Процедура ОплатаПередУдалением(Элемент, Отказ)
	текСтрока  			= Элементы.Оплата.ТекущиеДанные;	
	УдалитьСтрокиПоказаний(текСтрока.Абонент); 
КонецПроцедуры

&НаКлиенте
Процедура ОплатаАбонентАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	текСтрока  			= Элементы.Оплата.ТекущиеДанные;
	ТекАбонентОплаты 	= текСтрока.Абонент;
КонецПроцедуры

&НаКлиенте
Процедура ОплатаАбонентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	текСтрока  			= Элементы.Оплата.ТекущиеДанные;
	ТекАбонентОплаты 	= текСтрока.Абонент;
КонецПроцедуры  

#КонецОбласти

#Область СобытияТабличноцЧасти_ТочкиУчета

&НаКлиенте
Процедура ТочкиУчетаПриАктивизацииСтроки(Элемент)
	ТекДанные 								= Элементы.ТочкиУчета.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.ПоказанияПриборовУчета,Неопределено,ТекДанные.IDСтроки); 
	// энргРаботаСВидомДифференцированности }
	
	энргРаботаСПриборамиУчетаКлиент.РаботаСВидимостьюИДоступностьюСтрокПУ(ТекДанные.РегистрируетОбъем,Истина,Ложь,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаТочкаУчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	энргПользовательскийВводКлиент.НачалоВыбораТочкиУчета(Элемент, Новый Структура("ТочкиСПриборами", Истина));
КонецПроцедуры

#КонецОбласти

#Область СобытияТабличноцЧасти_ПоказанияПриборовУчета

&НаКлиенте
Процедура ПоказанияПриборовУчетаТекущиеПоказанияПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаСостояниеПоказанийПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);	
КонецПроцедуры 

&НаКлиенте
Процедура ПоказанияПриборовУчетаПереворотПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура ПечатьЧека(Команда)
	
	Если ПроверитьЗаполнениеДокумента() Тогда
		
		ОчиститьСообщения(); 		
			
		Если Объект.Статус <> ПредопределенноеЗначение("Перечисление.СтатусыЧековККМ.Пробит") Тогда
			
			Если УстройствоПечати.Пустая() Тогда
				ОписаниеОповещения = Новый ОписаниеОповещения("ПечатьЧекаЗавершение", ЭтотОбъект);
				ПоддерживаемыеТипыВО = Новый Массив();
				ПоддерживаемыеТипыВО.Добавить("ФискальныйРегистратор");
				ПоддерживаемыеТипыВО.Добавить("ПринтерЧеков");
				МенеджерОборудованияКлиент.ПредложитьВыбратьУстройство(ОписаниеОповещения, ПоддерживаемыеТипыВО,
					НСтр("ru='Выберите устройство печати'"), НСтр("ru='Устройство печати не подключено.'"));
			Иначе
				ИдентификаторУстройства = УстройствоПечати;
				ПечатьЧекаЗавершение(ИдентификаторУстройства, Неопределено);
			КонецЕсли;
			
		Иначе
			ОшибкаПовторнаяПечатьЧека();
		КонецЕсли;
		
	КонецЕсли;

	
КонецПроцедуры

#КонецОбласти


#Область ВспомогательныеПроцедурыИФункции

&НаКлиенте
Процедура УдалитьСтрокиПоказаний(текАбонент)
	ТекСтрока  			= Элементы.ПриборыУчета.ТекущиеДанные;
	СтрокиПоказаний  = Объект.ПриборыУчета.НайтиСтроки(Новый Структура("Абонент",текАбонент));
	для Каждого строка из СтрокиПоказаний цикл
		Объект.ПриборыУчета.Удалить(строка);
	КонецЦикла; 
КонецПроцедуры

// Процедура выводит предупреждение о невозможности повторной печати чека.
//
&НаКлиенте
Процедура ОшибкаПовторнаяПечатьЧека()
	
	ТекстПредупреждения = НСтр("ru = 'Чек уже пробит на фискальном регистраторе'");
	ПоказатьПредупреждение(, ТекстПредупреждения, 10);
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЧекаЗавершение(ИдентификаторУстройства, Параметры)
	
	ОписаниеОшибки = "";
	
	// Подключаем устройство печати
	Результат 	= МенеджерОборудованияКлиент.ПодключитьОборудованиеПоИдентификатору(УникальныйИдентификатор, ИдентификаторУстройства, ОписаниеОшибки);
	
	ВидОплаты 	= ПредопределенноеЗначение("Перечисление.ФормыОплаты.Наличные");
	
	Если Результат Тогда
		
		Расчет 	= Истина;
				
		// Готовим данные
		ВходныеПараметры  = Новый Массив;
		ВыходныеПараметры = Неопределено;
		
		// Подготовка соответствие секций для табличной части.
		ТаблицаТоваровСоответствиCекциям = Новый Соответствие();
		
		// ПодключаемоеОборудованиеДемоВызовСервера.ЗаполнитьСоответствиеСекцийДляТабличнойЧасти(Объект.РаспределенияВыручки, Объект.Товары, ТаблицаТоваровСоответствиCекциям);
		
		// Подготовка таблицы товаров
		ТаблицаТоваров = Новый Массив();
		
		// Для Каждого СтрокаТЧ Из Объект.Товары Цикл
		//	НомерСекции = ТаблицаТоваровСоответствиCекциям.Получить(СтрокаТЧ.НомерСтроки);
		СтрокаТаблицыТоваров = Новый СписокЗначений();
		СтрокаТаблицыТоваров.Добавить("За ВКУ");  				//  1 - Наименование
		СтрокаТаблицыТоваров.Добавить("");								//  2 - Штрихкод
		СтрокаТаблицыТоваров.Добавить("");								//  3 - Артикул
		СтрокаТаблицыТоваров.Добавить(1);								//  4 - Номер отдела
		СтрокаТаблицыТоваров.Добавить(Объект.ОбщаяСуммаОплаты);			//  5 - Цена за позицию без скидки.
		СтрокаТаблицыТоваров.Добавить(1);								//  6 - Количество
		СтрокаТаблицыТоваров.Добавить("");								//  7 - Наименование скидки/наценки.
		СтрокаТаблицыТоваров.Добавить(0);								//  8 - Сумма скидки/наценки
		СтрокаТаблицыТоваров.Добавить(0);								// 9 - Процент скидки/наценки
		СтрокаТаблицыТоваров.Добавить(Объект.ОбщаяСуммаОплаты);			// 10 - Сумма позиции со скидкой.
		СтрокаТаблицыТоваров.Добавить(0);								// 11 - Номер налога (1)
		СтрокаТаблицыТоваров.Добавить(0);								// 12 - Сумма налога (1)
		СтрокаТаблицыТоваров.Добавить(0);  								// 13 - Процент налога (1)
		СтрокаТаблицыТоваров.Добавить(0);								// 14 - Номер налога (2)
		СтрокаТаблицыТоваров.Добавить(0);								// 15 - Сумма налога (2)
		СтрокаТаблицыТоваров.Добавить(0);								// 16 - Процент налога (2)
		СтрокаТаблицыТоваров.Добавить("");								// 17 - Наименование секции форматирования товарной строки.
		
		ТаблицаТоваров.Добавить(СтрокаТаблицыТоваров);
		// КонецЦикла;
		
		// Подготовка таблицы оплат
		ТаблицаОплат = Новый Массив();
		
		// Наличные
		Если ВидОплаты = ПредопределенноеЗначение("Перечисление.ФормыОплаты.Наличные") тогда
			СтрокаОплаты = Новый СписокЗначений();
			СтрокаОплаты.Добавить(0);
			СтрокаОплаты.Добавить(Объект.ОбщаяСуммаОплаты);
			СтрокаОплаты.Добавить("Наличные");
			СтрокаОплаты.Добавить("");
			ТаблицаОплат.Добавить(СтрокаОплаты);			
		КонецЕсли;
		
		// Платежная карты
		Если ВидОплаты = ПредопределенноеЗначение("Перечисление.ФормыОплаты.ПлатежнаяКарта") тогда
			СтрокаОплаты = Новый СписокЗначений();
			СтрокаОплаты.Добавить(1);
			СтрокаОплаты.Добавить(Объект.СуммаОплаты);
			СтрокаОплаты.Добавить("Платежная оплата");
			СтрокаОплаты.Добавить("");
			ТаблицаОплат.Добавить(СтрокаОплаты);			
		КонецЕсли;
		
		// Кредит
		Если ВидОплаты = ПредопределенноеЗначение("Перечисление.ФормыОплаты.Кредит") тогда
			СтрокаОплаты = Новый СписокЗначений();
			СтрокаОплаты.Добавить(2);
			СтрокаОплаты.Добавить(Объект.СуммаОплаты);
			СтрокаОплаты.Добавить("Кредит");
			СтрокаОплаты.Добавить("");
			ТаблицаОплат.Добавить(СтрокаОплаты);			
		КонецЕсли;
		
		// Сертификат
		Если ВидОплаты = ПредопределенноеЗначение("Перечисление.ФормыОплаты.Сертификат") тогда
			СтрокаОплаты = Новый СписокЗначений();
			СтрокаОплаты.Добавить(3);
			СтрокаОплаты.Добавить(Объект.СуммаОплаты);
			СтрокаОплаты.Добавить("Сертификат");
			СтрокаОплаты.Добавить("");
			ТаблицаОплат.Добавить(СтрокаОплаты);
		КонецЕсли;
		
		// Подготовка таблицы общих параметров.
		ТипЧека 										= 0;
		
		ОбщиеПараметры 		= Новый Массив();
		ОбщиеПараметры.Добавить(ТипЧека);               // 1 - Тип чека (0-продажа, 1-возврат)
		ОбщиеПараметры.Добавить(Истина);                // 2 - Признак фискального чека
		ОбщиеПараметры.Добавить(Ложь);                  // 3 - Печать на подкладном документе
		ОбщиеПараметры.Добавить(Объект.ОбщаяСуммаОплаты); 	// 4 - Сумма по чеку без скидок/наценок
		ОбщиеПараметры.Добавить(Объект.ОбщаяСуммаОплаты); 	// 5 - Сумма по чеку с учетом всех скидок/наценок
		ОбщиеПараметры.Добавить("");                    // 6 - Номер дисконтной карты
		ОбщиеПараметры.Добавить("");    				// 7 - Текст шапки (Для чека ЕНВД)
		ОбщиеПараметры.Добавить("");  					// 8 - Текст подвала (Для чека ЕНВД)
		ОбщиеПараметры.Добавить(0);                     // 9 - Номер смены 
		ОбщиеПараметры.Добавить(1);                     // 10 - Номер чека (Для чека ЕНВД)
		ОбщиеПараметры.Добавить(1);                     // 11 - Номер кассы (Для чека ЕНВД)
		ОбщиеПараметры.Добавить(ТекущаяДата());         // 12 - Дата и время документа 
		ОбщиеПараметры.Добавить(Объект.Ответственный);  // 13 - Кассир (Для чека ЕНВД)
		ОбщиеПараметры.Добавить("МУП Водоканал");    	// 14 - Название организации (Для чека ЕНВД)
		ОбщиеПараметры.Добавить("");       				// 15 - ИНН организации (Для чека ЕНВД)
		ОбщиеПараметры.Добавить("");                    // 16 - Наименование секции форматирования шапки
		ОбщиеПараметры.Добавить("");                    // 17 - Наименование секции форматирования подвала	
		
		ВходныеПараметры.Добавить(ТаблицаТоваров);
		ВходныеПараметры.Добавить(ТаблицаОплат);
		ВходныеПараметры.Добавить(ОбщиеПараметры);
		
		// Печатаем чек.
		Результат 			= МенеджерОборудованияКлиент.ВыполнитьКоманду(ИдентификаторУстройства, "PrintReceipt", ВходныеПараметры, ВыходныеПараметры);
		
		Текст 				= ПолучитьТекстНеФиксальнойСтроки();
		
		ВходныеПараметры 	= Новый Массив;
		ВходныеПараметры.Добавить(Текст);
		ВыходныеПараметры 	= Неопределено;
		
		Результат 			= МенеджерОборудованияКлиент.ВыполнитьКоманду(ИдентификаторУстройства, "PrintText", ВходныеПараметры, ВыходныеПараметры);
		Если Не Результат Тогда
			ТекстСообщения 	= НСтр("ru = 'При печати слип чека возникла ошибка:
			|""%ОписаниеОшибки%"".'");
			ТекстСообщения 	= СтрЗаменить(ТекстСообщения,"%ОписаниеОшибки%",ВыходныеПараметры[1]);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;   	
		// Отключаем устройство печати
		МенеджерОборудованияКлиент.ОтключитьОборудованиеПоИдентификатору(УникальныйИдентификатор, ИдентификаторУстройства);
		
		Если Результат Тогда
			// Установить полученное значение номера чека реквизиту документа.
			Объект.НомерСменыККМ = ВыходныеПараметры[0];
			Объект.НомерЧекаККМ = ВыходныеПараметры[1];
			
			Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЧековККМ.Пробит");
			Объект.Дата = МенеджерОборудованияКлиентПереопределяемый.ДатаСеанса();
			Если Не ЗначениеЗаполнено(Объект.НомерЧекаККМ) Тогда
				Объект.НомерЧекаККМ = 1;
			КонецЕсли;
			
			ПараметрыЗаписи = Новый Структура("РежимЗаписи, РежимПроведения",
			РежимЗаписиДокумента.Проведение,
			РежимПроведенияДокумента.Оперативный);
			Если ЗаписатьДокументНаСервере(ПараметрыЗаписи) Тогда
				
			Иначе
				ТекстСообщения = НСтр("ru = 'Ошибка записи документа'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;					
		Иначе
			ТекстСообщения = НСтр("ru = 'При печати чека произошла ошибка. Чек не напечатан.
			|Дополнительное описание: %ДополнительноеОписание%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", ВыходныеПараметры[1]);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		
	Иначе
		ТекстСообщения = НСтр("ru = 'При подключении устройства произошла ошибка.
		|Дополнительное описание: %ДополнительноеОписание%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", ОписаниеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьЗаполнениеДокумента()
	
	Результат = Истина;
	
	Текст = "";
	Если Объект.ОбщаяСуммаОплаты = 0 Тогда
		Текст = Текст + НСтр("ru = 'Не указана сумма оплаты'");
		Результат = Ложь;
	КонецЕсли;
	
	//Если Не ЗначениеЗаполнено(Объект.ВидОплаты) Тогда
	//	Текст = Текст + НСтр("ru = 'Не указан вид оплаты'");
	//	Результат = Ложь;
	//КонецЕсли;
	
	Если не Объект.Проведен или Модифицированность тогда
		Текст = Текст + НСтр("ru = 'Печать чека возможно только после проведения документа'");
		Результат = Ложь;
	КонецЕсли;
	
	Если Текст <> "" Тогда
		ТекстЗаголовка = НСтр("ru = 'Ошибка заполнения'");
		ПоказатьПредупреждение(, Текст, 10 ,ТекстЗаголовка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте 
Функция ПолучитьТекстНеФиксальнойСтроки()
		
	ШиринаСтрокиПечатающегоУстройва = ?(ШиринаСтрокиПечатающегоУстройва = Неопределено, 32, ШиринаСтрокиПечатающегоУстройва);
	
	ФорматЧисла 			= "ЧРД=,;ЧЦ=10;ЧДЦ=2;ЧН=0,00;ЧГ=0";
	
	// Шапка
	Текст = "Чек-ордер " + Символы.ПС +
	"Операция: " 			+ "" 												
	+ Символы.ПС +
	"Дата: " 				+ Формат(Объект.Дата,"ДФ=dd.MM.yyyy") 												
	+ Символы.ПС +
	"Кассир: " 				+ РазложитьСтрокуПоШиринеСтроки(8,ШиринаСтрокиПечатающегоУстройва,ТекущийПользователь)
	+ Символы.ПС +
	"Всего сумма: " 		+ Объект.ОбщаяСуммаОплаты								
	+ Символы.ПС + 
	"Получатель: " 			+ БанковскиеРеквизиты.НаименованиеОрганизации								
	+ Символы.ПС +
	"ИНН: " 				+ БанковскиеРеквизиты.ИННОрганизации										
	+ Символы.ПС +
	"Счет: " 				+ БанковскиеРеквизиты.НомерСчетаОрганизации												
	+ Символы.ПС +
	"БИК: " 				+ БанковскиеРеквизиты.БИКБанка												
	+ Символы.ПС +
	"Кор.счет: "			+ БанковскиеРеквизиты.КоррСчетБанка												
	+ Символы.ПС +
	"Назначение платежа: "	+ БанковскиеРеквизиты.НазначениеПлатежа;												
		
	Возврат Текст;
	
КонецФункции

&НаКлиенте
Функция РазложитьСтрокуПоШиринеСтроки(ЗанятоСимволов,ШиринаСтроки,Текст)
	ИтоговаяСтрока  		= "";
	ТекСтрока  				= "";
	
	МассивСтрок  			= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Текст," ");
	
	Если МассивСтрок.количество()  = 0 тогда
		Возврат Текст;
	КонецЕсли; 	
	
	ДлинаСтроки 			= ЗанятоСимволов + СтрДлина(МассивСтрок[0]);
	Если ДлинаСтроки > ШиринаСтроки тогда
		 ИтоговаяСтрока 	= ИтоговаяСтрока + Символы.ПС + МассивСтрок[0];
		 ТекСтрока 			= МассивСтрок[0];
		 ТекДлинаСтроки 	= СтрДлина(ТекСтрока);
	 иначе
		 ТекСтрока 			= ТекСтрока 	 + МассивСтрок[0];
		 ТекДлинаСтроки 	= ЗанятоСимволов + СтрДлина(ТекСтрока);
	 КонецЕсли;
	         	 
	для Счетчик = 1 по МассивСтрок.количество()-1 цикл
		ПодСтрока  			= МассивСтрок[Счетчик];
		Символов  			= СтрДлина(ПодСтрока);
		Если ТекДлинаСтроки + Символов > ШиринаСтроки тогда
			 ИтоговаяСтрока = ИтоговаяСтрока + ?(ЗначениеЗаполнено(ИтоговаяСтрока),Символы.ПС,"") + ТекСтрока;
			 ТекДлинаСтроки = Символов;
			 ТекСтрока 		= ПодСтрока;
		 иначе
			 ТекСтрока 		= ТекСтрока + " " + ПодСтрока;
		 КонецЕсли;
		
		 ТекДлинаСтроки 	= СтрДлина(ТекСтрока);
	КонецЦикла;
	 ИтоговаяСтрока 		= ИтоговаяСтрока + ТекСтрока; 
	Возврат ИтоговаяСтрока;
КонецФункции

&НаСервере
Процедура ЗаполнитьДанныеПриборовУчетаСервер(ДанныеСтроки)
	
	ТаблицаПоказаний  			= Объект.ПриборыУчета.Выгрузить();
	ТаблицаПоказаний.Очистить();
	
	СтрокиПоказаний  = Объект.ПриборыУчета.НайтиСтроки(Новый Структура("Абонент",ДанныеСтроки.Абонент));
	для Каждого строка из СтрокиПоказаний цикл
		Объект.ПриборыУчета.Удалить(строка);
	КонецЦикла;
	
	// выводим данные по подключенным услугам и задолженности
	Результат 						= энргРаботаСприборамиУчетаСервер.ДействующиеПриборыУчетаАбонента(Объект.Дата,Объект.Организация, ДанныеСтроки.Район,ДанныеСтроки.КлючПомещения); 
	Выборка  						= Результат.выбрать();
	Счетчик 						= 0;
	Пока Выборка.следующий() цикл
		СтрокаТЗ 					= ТаблицаПоказаний.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЗ,Выборка);
		СтрокаТЗ.НомерСтроки 		= Счетчик;
		Счетчик 					= Счетчик + 1;
	КонецЦикла; 
	
	ТаблицаПоказанийДляЗаполнения 			= энргРаботаСПоказаниямиПриборовУчетаСервер.ТаблицаПоказаний(Объект.Организация,ТаблицаПоказаний,ТаблицаПоказаний,ТаблицаПоказаний,ДанныеСтроки.Район,ДанныеСтроки.КлючПомещения); 
	РезультатДанныеЗаполненияПоказаний 		= Обработки.энргПоказанияПриборовУчетаМенеджер.РезультатДанныеЗаполненияТаблицыПоказаний(Объект.Организация,ТаблицаПоказанийДляЗаполнения,Объект.Дата);
	энргРаботаСПоказаниямиПриборовУчетаСервер.ЗаполнитьТабличнуюЧастьПоказанийПриборовУчета(РезультатДанныеЗаполненияПоказаний,ТаблицаПоказанийДляЗаполнения,ТаблицаПоказаний);
		
	для Каждого стр из ТаблицаПоказаний цикл
		СтрокаПриборов 				= Объект.ПриборыУчета.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаПриборов,стр);
		СтрокаПриборов.Абонент 		= ДанныеСтроки.Абонент;
		СтрокаПриборов.ЛицевойСчет 	= ДанныеСтроки.ЛицевойСчет;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ЗаписатьДокументНаСервере(ПараметрыЗаписи)
	
	Попытка
		Результат = Записать(ПараметрыЗаписи);
	Исключение
		ТекстСообщения = НСтр("ru = 'Не удалось провести документ'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
